app/controllers/main_controller.rb

INSERT INTO "request_models" ("request_date", "remote_ip", "request_method", "scheme_request", "query_string", "cookies", "headers", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def save_request
    rqst = RequestModel.new
    rqst.trap_id = params[:trap_id]
    rqst.headers = headers.to_json
    rqst.cookies = cookies.to_json
    rqst.request_method = request.scheme
    rqst.query_string = request.env[:request_uri]
    rqst.remote_ip = request.ip
    rqst.query_string = request.original_fullpath
    rqst.request_method = request.request_method
    rqst.scheme_request = request.scheme
    rqst.query_params = params.to_json
    if rqst.save

SELECT "request_models".* FROM "request_models" WHERE (trap_id = '4') ORDER BY created_at desc
---
  def show_requests
    @requests = RequestModel.where('trap_id = ?', params[:trap_id]).order('created_at desc')