app/controllers/main_controller.rb

SELECT "request_models".* FROM "request_models" WHERE (trap_id = '44') ORDER BY request_date desc
---
  def show_requests
    @requests = RequestModel.where('trap_id = ?', params[:trap_id]).order('request_date desc')